### Create Data Type And Value Rules

In [2]:
# Ignore
%load_ext sql
%sql sqlite://
%config SqlMagic.feedback = False

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

### Create New Table With Constraints On What Data Can Be Inserted

In [5]:
%%sql

CREATE TABLE criminals
( pid INT PRIMARY KEY NOT NULL,
name TEXT DEFAULT 'John Doe',
age INT CHECK (0< age<100));

(sqlite3.OperationalError) table criminals already exists [SQL: "CREATE TABLE criminals\n( pid INT PRIMARY KEY NOT NULL,\nname TEXT DEFAULT 'John Doe',\nage INT CHECK (0< age<100));"]

### Add Data To Table

In [7]:
%%sql

INSERT INTO criminals VALUES (412, 'James Smith', 15);
INSERT INTO criminals VALUES (234, 'Bill James', 22);
INSERT INTO criminals VALUES (632, 'Bill Steve', 23);
INSERT INTO criminals VALUES (621, 'Betty Bob', NULL);
INSERT INTO criminals VALUES (162, 'Jaden Ado', 49);
INSERT INTO criminals VALUES (901, 'Gordon Ado', 32);
INSERT INTO criminals VALUES (512, 'Bill Byson', 21);
INSERT INTO criminals VALUES (411, 'Bob Iton', NULL);

[]

### View Table

In [8]:
%sql SELECT * FROM criminals

[(412, 'James Smith', 15),
 (234, 'Bill James', 22),
 (632, 'Bill Steve', 23),
 (621, 'Betty Bob', None),
 (162, 'Jaden Ado', 49),
 (901, 'Gordon Ado', 32),
 (512, 'Bill Byson', 21),
 (411, 'Bob Iton', None)]

Source: https://chrisalbon.com/sql/create_rules_constraining_data.html